sf-soap.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://soap.sforce.com/schemas/class/HelperClass">
   <soapenv:Header>
      <hel:AllowFieldTruncationHeader>
         <hel:allowFieldTruncation>0</hel:allowFieldTruncation>
      </hel:AllowFieldTruncationHeader>

      <hel:CallOptions>
         <hel:client>27.0</hel:client>
      </hel:CallOptions>
      <hel:SessionHeader>
         <hel:sessionId>00DG0000000CkUd!AQ0AQASO7j5Ae1w4EEXNK0SzBcDqAJUh7CiTdDb4Jlp_.XRM7qWOzPy4NBKokqrrOUMIj6295JXBP2ZdlgTqzUCCjXE6UNBJ</hel:sessionId>
      </hel:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <hel:presentationUploaded>
         <hel:sliders_cnt>10</hel:sliders_cnt>
	 <hel:app_id>10</hel:app_id>
      </hel:presentationUploaded>
   </soapenv:Body>
</soapenv:Envelope>
